{
  "backend/main.mo": "Main Motoko actor for The Jurists backend defining data types (Jurisdiction, LeadStatus, PracticeArea, etc.), contact form submission storage, and access control initialization for an ICP-based legal services app.",
  "feature_evidence.json": "Feature evidence report mapping two completed features—email address replacement and visual theme revert—to their affected frontend files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document summarizing the purpose and recent changes of each frontend source file for build planning reference.",
  "frontend/index.html": "Root HTML entry point that mounts the React app and includes Google Tag Manager and AMP Analytics script tags.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console site verification file for thejurists.in.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers full site access and pointing to the sitemap at https://thejurists.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public pages of thejurists.in including home, services, blog, contact, and jurisdiction pages with priorities and change frequencies.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes (services, blog, jurisdictions, admin, etc.) and wrapping the app in ThemeProvider and ErrorBoundary.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty file with no content.",
  "frontend/src/components/Breadcrumbs.tsx": "Breadcrumb navigation component that renders a linked trail with chevron separators and injects a JSON-LD BreadcrumbList structured data schema.",
  "frontend/src/components/ContactForm.tsx": "Contact form component that embeds a Google Forms iframe (defaulting to a specific form URL) inside a styled Card with luxury theme styling.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches rendering errors and displays a styled error UI with options to retry or navigate home, supporting an optional custom fallback.",
  "frontend/src/components/FAQSection.tsx": "Renders an accordion-based FAQ section with a title, injecting FAQ structured data (JSON-LD) into the page via the StructuredData component.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, quick links, practice area links, and jurisdiction links for The Jurists law firm.",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with desktop dropdowns for Services and Jurisdictions and a responsive mobile menu for The Jurists site.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps page content with the shared Header and Footer, rendering child routes via Outlet.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter their name and saves the profile using the useSaveCallerUserProfile mutation.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content.",
  "frontend/src/components/SEOHead.tsx": "Imperatively updates document title, meta description, canonical link, Open Graph, and Twitter Card tags via useEffect for SEO purposes.",
  "frontend/src/components/StructuredData.tsx": "Injects JSON-LD structured data scripts into the document head and exports helper functions for generating LocalBusiness, Organization, LegalService, and FAQ schemas.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, contact form submissions, admin checks, and blog articles.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines a navy/gold luxury color palette with CSS custom properties for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page for The Jurists law firm displaying team members, firm values, and story sections with SEO metadata and structured data.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty admin dashboard page file with no content.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog article fetched by ID with SEO head, structured data, breadcrumbs, and formatted metadata like date and practice area category.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog articles in a card grid with SEO metadata, breadcrumbs, loading/empty states, and navigation to individual article detail pages.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with a hero section, contact info cards (location, email, hours), a contact form, and an embedded map, including SEO metadata and structured data.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty file, likely a placeholder for a Google site verification page.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with a hero section, practice areas grid, 'Why Choose Us' highlights, and SEO/structured data for The Jurists law firm in Hyderabad.",
  "frontend/src/pages/InitializeAdminPage.tsx": "One-time admin setup page that authenticates via Internet Identity and calls an initialization mutation to grant the caller admin access, then redirects to the leads dashboard.",
  "frontend/src/pages/JurisdictionPage.tsx": "Reusable page component that renders location-specific legal service content for Hyderabad, Secunderabad, Rangareddy, or Cyberabad, driven by a jurisdiction prop and a static data map.",
  "frontend/src/pages/LeadsPage.tsx": "Admin-only dashboard that lists contact form submissions with filtering by jurisdiction and status, supports status updates, and guards access via Internet Identity and admin role checks.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Renders a detailed page for each legal service (family law, corporate law, etc.) using route params, displaying description, features list, and SEO metadata with structured data.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of all 11 legal services offered by The Jurists with icons, descriptions, gradient styling, and links to individual service detail pages.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file with no content or exports.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, serif/sans font families, luxury box shadows, border radii, and accordion/fade-in animations.",
  "project_state.json": "Tracks project state at version 3, recording completed features (email update, theme revert to 42nd draft) and architectural notes like phone/login button removal."
}