{
  "backend/main.mo": "Main Motoko actor defining the backend for a legal services site, including jurisdiction/status enums, contact form submission types, chatbot Q&A data, and associated CRUD/query logic.",
  "feature_evidence.json": "Feature evidence report mapping completed feature IDs (tagline change, chatbot removal, legal banner restore, team section removal, Cyberabad rename) to their affected frontend files and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and recent changes of every component, page, hook, and config file in the project.",
  "frontend/index.html": "Root HTML entry point for the React app, including Google Tag Manager and AMP Analytics script tags, with a single #root div and the main.tsx module entry point.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console site verification file containing the verification token for thejurists.in.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers full site access and pointing to the sitemap at https://thejurists.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public URLs for thejurists.in including home, about, services, blog, contact, and jurisdiction pages with priorities and change frequencies.",
  "frontend/src/App.tsx": "TanStack Router app setup registering all routes including jurisdiction pages, legacy Cyberabad redirects to MedchalMalkajgiri, Telangana High Court route, and admin/leads routes, with ChatbotWidget removed.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty file with no content; likely a placeholder for a backlink submission panel component.",
  "frontend/src/components/Breadcrumbs.tsx": "Breadcrumb navigation component that renders a linked trail with chevron separators and injects JSON-LD breadcrumb structured data for SEO.",
  "frontend/src/components/ChatbotWidget.tsx": "A floating chat widget component that renders a toggleable chat panel with message history, typing indicator, quick suggestion buttons, and keyboard input, using the useChatbot hook for state management.",
  "frontend/src/components/ContactForm.tsx": "Renders a consultation request card that embeds a Google Form via iframe, with a configurable URL prop defaulting to a hardcoded Google Forms link.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors and displays an alert with error details, plus 'Try Again' and 'Go Home' recovery buttons.",
  "frontend/src/components/FAQSection.tsx": "Renders an accordion-based FAQ section from a list of question/answer pairs, and injects FAQ structured data (JSON-LD) via the StructuredData component.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Footer.tsx": "Site-wide footer with brand info, contact details, quick navigation links, and a list of practice area links, built with TanStack Router's Link component.",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Header.tsx": "Sticky site header with a logo, desktop navigation including hover-activated dropdowns for Services and Jurisdictions, and a responsive mobile menu.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a legal notice banner, header, main content outlet, and footer.",
  "frontend/src/components/LegalNoticeBanner.tsx": "A dismissible top banner displaying a Bar Council of India legal disclaimer about the informational nature of the site.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible modal dialog that prompts new users to enter their name and saves the profile via the useSaveCallerUserProfile mutation hook.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SEOHead.tsx": "A headless component that imperatively updates document title, meta description, keywords, canonical link, Open Graph, and Twitter Card tags via useEffect.",
  "frontend/src/components/StructuredData.tsx": "React component that injects JSON-LD structured data scripts into the document head, plus helper functions to generate LocalBusiness, Organization, and LegalService schema objects for The Jurists law firm.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useChatbot.ts": "Custom hook managing chatbot state and message history, sending user messages to the backend actor via a React Query mutation and appending bot responses or error messages.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, contact form submissions, admin checks, and blog articles with appropriate caching and invalidation logic.",
  "frontend/src/index.css": "Global stylesheet importing Playfair Display and Lato fonts, defining Tailwind base/component/utility layers, CSS custom properties for light/dark themes, and a fadeIn animation utility.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AboutPage.tsx": "About page for The Jurists law firm displaying the firm's story, values, and practice areas, with SEO metadata and LocalBusiness structured data injected into the head.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog article fetched by ID, including SEO metadata, structured data, breadcrumbs, category label, author/date meta, and article content with a loading skeleton and not-found fallback.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog articles with category filter tabs, loading skeletons, and an empty state; fetches articles via a query hook and navigates to detail pages on click.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with office info cards, a contact form component, SEO/structured data tags, and a location image placeholder.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty file, likely a placeholder for a Google site verification page.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with a hero section, practice area cards, highlights grid, SEO head, and structured data for the local business.",
  "frontend/src/pages/InitializeAdminPage.tsx": "Provides a one-time admin setup UI that checks initialization status, prompts Internet Identity login if needed, and calls the initialize access control mutation before redirecting to the leads dashboard.",
  "frontend/src/pages/JurisdictionPage.tsx": "Reusable page component that renders jurisdiction-specific content (court name, description, highlights, image) for Hyderabad, Secunderabad, Rangareddy, or Medchal Malkajgiri, with SEO head and breadcrumbs.",
  "frontend/src/pages/LeadsPage.tsx": "Admin-only dashboard page that displays, filters, and exports contact form submissions as a table, with status update functionality and CSV export.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Dynamic detail page for individual legal services, rendering title, description, features, and SEO metadata based on a URL slug mapped to static service data.",
  "frontend/src/pages/ServicesPage.tsx": "Overview page listing all available legal services as a grid of cards with images, descriptions, and navigation links to individual service detail pages.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file with no content.",
  "frontend/src/pages/TelanganaHighCourtPage.tsx": "SEO-optimized landing page for the firm's Telangana High Court practice, highlighting writ petitions, appeals, and constitutional matters with structured data and breadcrumbs.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based colors, custom serif/sans fonts, luxury box shadows, and fade-in animation, plus animate and typography plugins.",
  "project_state.json": "Tracks the project state (version 3) for a legal services website, documenting existing features, known issues, architectural notes, and requirements such as tagline updates, banner restoration, and jurisdiction renaming from 'Cyberabad' to 'Medchal Malkajgiri and Kukatpally Courts'."
}