{
  "backend/main.mo": "Main Motoko actor for The Jurists backend, defining data types (Jurisdiction, LeadStatus, PracticeArea, ContactFormSubmission) and managing contact form submissions with access control, admin initialization, and CRUD operations.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features recorded.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of all frontend source files, describing each component's purpose and key implementation details.",
  "frontend/index.html": "Root HTML entry point for the React app with Google Tag Manager and AMP Analytics script tags, mounting the app at the #root div.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console site verification file for thejurists.in.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers full site access and pointing to the sitemap at https://thejurists.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public URLs for The Jurists website including home, services, blog, contact, and jurisdiction pages with priorities and change frequencies.",
  "frontend/src/App.tsx": "Main React application component that sets up TanStack Router with all routes (home, services, blog, jurisdictions, admin pages) wrapped in ThemeProvider and ErrorBoundary.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Breadcrumbs.tsx": "Breadcrumb navigation component that renders a linked trail with chevron separators and injects JSON-LD breadcrumb structured data for SEO.",
  "frontend/src/components/ContactForm.tsx": "Contact form component that embeds a Google Forms iframe for consultation requests, defaulting to a pre-configured form URL with luxury card styling.",
  "frontend/src/components/ErrorBoundary.tsx": "React class-based error boundary that catches rendering errors and displays a styled error UI with options to retry or navigate home.",
  "frontend/src/components/FAQSection.tsx": "Accordion-based FAQ section component that renders a list of questions/answers and injects FAQ JSON-LD structured data for SEO.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, contact info, and navigation links for quick links, services, and jurisdictions (Hyderabad, Secunderabad, Rangareddy, Cyberabad).",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, a jurisdictions dropdown, Internet Identity login/logout, and conditional admin/initialize links based on authentication and admin status.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps page content with the Header and Footer, rendering child routes via an Outlet.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a newly authenticated user to enter their name and saves the profile using the useSaveCallerUserProfile mutation.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content.",
  "frontend/src/components/SEOHead.tsx": "Headless component that dynamically updates document title, meta description, canonical link, Open Graph, and Twitter Card tags via useEffect.",
  "frontend/src/components/StructuredData.tsx": "Injects JSON-LD structured data scripts into the document head and exports helper functions for generating LocalBusiness, Organization, LegalService, and Breadcrumb schemas.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY AuthClient login, logout, and identity state with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend actor interactions including user profile management, contact form submissions (CRUD), admin checks, and blog articles.",
  "frontend/src/index.css": "Global CSS file configuring Tailwind base/components/utilities and defining a luxury navy-and-gold color palette via CSS custom properties for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "About page component displaying the firm's story, core values, and achievements with SEO metadata and structured data for The Jurists law firm.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty admin dashboard page file with no content.",
  "frontend/src/pages/BlogDetailPage.tsx": "Blog article detail page that fetches and displays a single article by ID with SEO metadata, structured data, breadcrumbs, and practice area badges.",
  "frontend/src/pages/BlogListPage.tsx": "Blog listing page that fetches and displays all blog articles in a card grid with category badges, excerpts, and navigation to individual article pages.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying office email, location, hours, an embedded Google Map, and a contact form with SEO metadata and local business structured data.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty Google verification page file with no content.",
  "frontend/src/pages/HomePage.tsx": "The main landing page for The Jurists law firm, displaying a hero section, practice area cards with images, and a 'why choose us' section with SEO metadata and structured data.",
  "frontend/src/pages/InitializeAdminPage.tsx": "A one-time setup page that allows the first Internet Identity user to claim admin access for the platform, with status checks and automatic redirect to the leads dashboard on success.",
  "frontend/src/pages/JurisdictionPage.tsx": "A reusable page component that renders location-specific legal service information (practice areas, contact email) for each of four jurisdictions: Hyderabad, Secunderabad, Rangareddy, and Cyberabad.",
  "frontend/src/pages/LeadsPage.tsx": "An admin-only dashboard page that displays, filters, and updates the status of contact form submissions, with authentication and admin-role guards before rendering the leads table.",
  "frontend/src/pages/ServiceDetailPage.tsx": "A reusable detail page component that renders service-specific content (description, sub-services, benefits, FAQs) for each legal practice area based on a service slug prop.",
  "frontend/src/pages/ServicesPage.tsx": "Renders a grid of legal service cards (Family Law, Corporate Law, Criminal Defense, etc.) with icons, images, and links to individual service pages, plus SEO metadata and structured data.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file with no content or exports defined.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting URL parameters from both query strings and hash-based routing, with sessionStorage persistence helpers and a function to clean sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, border radii, box shadows, spacing, and keyframe animations, using the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project metadata and feature request status for 'The Jurists', with one pending task to deploy the backend Motoko canister and frontend React app to the Internet Computer mainnet."
}