{
  "backend/main.mo": "Main Motoko actor defining the backend for a legal services site, including jurisdiction/status enums, contact form submission types, chatbot Q&A data, and associated CRUD/query logic.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—replacing the LegalNoticeBanner with a footer disclaimer and adding a legal notice promotional banner on the homepage—to their affected files and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, serving as a reference document for the project's frontend structure.",
  "frontend/index.html": "Root HTML entry point for the React app, including Google Tag Manager and AMP Analytics script tags, with a root div and module script loading main.tsx.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console site verification file containing the verification token for thejurists.in.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers full site access and pointing to the sitemap at https://thejurists.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public URLs for thejurists.in including home, about, services, blog, contact, jurisdiction, and practice area pages with priorities and change frequencies.",
  "frontend/src/App.tsx": "TanStack Router app setup registering all routes including jurisdiction pages (Hyderabad, Secunderabad, Rangareddy, MedchalMalkajgiri, Telangana High Court), legacy Cyberabad redirects, and admin/leads routes.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Breadcrumbs.tsx": "Breadcrumb navigation component that renders a linked trail with chevron separators and injects a JSON-LD BreadcrumbList structured data schema for SEO.",
  "frontend/src/components/ChatbotWidget.tsx": "A floating chat widget component that renders a toggleable chat panel with message history, typing indicator, quick suggestion buttons, and keyboard-accessible input using the useChatbot hook.",
  "frontend/src/components/ContactForm.tsx": "Renders a consultation request card that embeds a Google Form via iframe, with a configurable URL prop defaulting to a hardcoded Google Forms link.",
  "frontend/src/components/ErrorBoundary.tsx": "A React class-based error boundary that catches rendering errors and displays an alert UI with error details, a retry button, and a home navigation button.",
  "frontend/src/components/FAQSection.tsx": "Renders a list of FAQ items as an accessible accordion component and injects FAQ structured data (JSON-LD) into the page via the StructuredData component.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Footer.tsx": "Site-wide footer component displaying brand info, contact details, quick navigation links, and a list of practice area links for The Jurists law firm.",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Header.tsx": "Sticky site header with logo, desktop navigation including hover-activated dropdowns for Services and Jurisdictions, and a mobile hamburger menu.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a shared Header, Footer, and a flex-column structure using TanStack Router's Outlet.",
  "frontend/src/components/LegalNoticeBanner.tsx": "A dismissible top banner that displays a Bar Council of India legal disclaimer, persisting the dismissed state in sessionStorage.",
  "frontend/src/components/ProfileSetupModal.tsx": "A non-dismissible dialog modal that prompts a new user to enter their name and saves the profile via the useSaveCallerUserProfile mutation hook.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content or exports.",
  "frontend/src/components/SEOHead.tsx": "A headless component that imperatively updates document title, meta description, canonical link, Open Graph, and Twitter Card tags via useEffect for SEO purposes.",
  "frontend/src/components/StructuredData.tsx": "React component that injects JSON-LD structured data scripts into the document head, plus helper functions to generate LocalBusiness, Organization, and LegalService schema objects for The Jurists law firm.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content or exports.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useChatbot.ts": "Custom hook managing chatbot state and message history, sending user messages to the backend actor via a mutation and appending bot responses or error messages to the conversation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider context and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, contact form submissions, admin checks, and blog articles with appropriate caching and invalidation logic.",
  "frontend/src/index.css": "Global stylesheet importing Playfair Display and Lato fonts, defining Tailwind base/component/utility layers, CSS custom properties for light/dark themes, and a fadeIn animation utility.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/AboutPage.tsx": "About page for The Jurists law firm featuring SEO metadata, LocalBusiness structured data, a hero section, firm story, practice areas checklist, and core values.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog article fetched by ID, with SEO metadata, structured data, breadcrumbs, and formatted content including category, author, and published date.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog articles with category filter tabs, loading skeletons, and navigation to individual article pages, with SEO head included.",
  "frontend/src/pages/ContactPage.tsx": "Contact page showing office location, email, availability cards, a contact form, and a location image, with SEO and local business structured data.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty file, likely a placeholder for a Google site verification page.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero section, practice area cards, and firm highlights, with SEO metadata and local business structured data.",
  "frontend/src/pages/InitializeAdminPage.tsx": "Admin setup page that checks if access control is initialized and allows an authenticated Internet Identity user to initialize it, then redirects to the leads dashboard.",
  "frontend/src/pages/JurisdictionPage.tsx": "Reusable jurisdiction-specific landing page that renders court details, highlights, and practice area links for Hyderabad, Secunderabad, Rangareddy, or Medchal Malkajgiri based on a prop.",
  "frontend/src/pages/LeadsPage.tsx": "Admin-only dashboard page that displays, filters, and exports contact form submissions as a table, with status update functionality and CSV export.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Dynamic detail page for individual legal services (e.g., family law, corporate law), rendering service-specific content, features list, SEO metadata, and breadcrumbs based on URL params.",
  "frontend/src/pages/ServicesPage.tsx": "Grid listing page for all legal service offerings with images, descriptions, and navigation links to individual service detail pages.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file with no content.",
  "frontend/src/pages/TelanganaHighCourtPage.tsx": "Landing page for the firm's Telangana High Court practice, highlighting writ petitions, appeals, and constitutional matters with SEO metadata, structured data, and links to other jurisdictions.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL query parameters (supporting both standard and hash-based routing), persist them in sessionStorage, and remove sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based colors, custom serif/sans fonts, border radii, luxury box shadows, and a fade-in animation, plus animate and typography plugins.",
  "project_state.json": "Tracks project state for 'The Jurists' legal/advocate website, including two existing features (condensed legal disclaimer at page bottom and a promotional legal notice banner on the homepage) and their corresponding pending feature requests."
}