{
  "backend/main.mo": "Main Motoko actor for the legal services backend, defining data types (Jurisdiction, LeadStatus, PracticeArea, etc.), contact form submission storage, and access control initialization for an admin-gated leads management system.",
  "feature_evidence.json": "Feature evidence report mapping four UI revert/cleanup features (theme revert, image restore, phone number removal, login button removal) to their affected frontend files and components with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated summary index describing the purpose and key changes of each frontend source file, serving as a reference for build planning and code navigation.",
  "frontend/index.html": "Root HTML entry point for the React app, including Google Tag Manager and AMP Analytics script tags, with a single root div and the main.tsx module entry point.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console site verification file confirming ownership of the domain.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawlers full site access and pointing to the sitemap at https://thejurists.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "Static XML sitemap listing all public pages of thejurists.in including home, about, services, blog, contact, and jurisdiction pages with priorities and change frequencies.",
  "frontend/src/App.tsx": "TanStack Router configuration defining all application routes including service detail, jurisdiction (both current and legacy paths), admin, and leads pages, wrapped in ThemeProvider and ErrorBoundary.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty file with no content; likely a placeholder for a backlink submission panel component.",
  "frontend/src/components/Breadcrumbs.tsx": "Breadcrumb navigation component that renders a linked trail with chevron separators and injects a JSON-LD breadcrumb schema via the StructuredData component.",
  "frontend/src/components/ContactForm.tsx": "Contact form component that embeds a Google Forms iframe (defaulting to a specific form URL) inside a styled Card with luxury theme borders and a 640×978px iframe.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches rendering errors and displays a styled error UI with options to retry or navigate home, supporting an optional custom fallback.",
  "frontend/src/components/FAQSection.tsx": "Renders an accordion-based FAQ section with structured data (FAQ schema) injected into the page head via the StructuredData component.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Site footer component displaying brand info, quick links, practice area links, and jurisdiction links for a Hyderabad law firm.",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with desktop dropdowns for Services and Jurisdictions and a responsive mobile menu for the law firm site.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with a shared Header and Footer, rendering child routes via TanStack Router's Outlet.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and saves the profile using the useSaveCallerUserProfile mutation hook.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content.",
  "frontend/src/components/SEOHead.tsx": "Imperatively sets document title, meta description, canonical link, Open Graph, and Twitter Card tags via useEffect for client-side SEO management.",
  "frontend/src/components/StructuredData.tsx": "Injects JSON-LD structured data scripts into the document head and exports helper functions for generating LocalBusiness, Organization, LegalService, and FAQ schemas.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, contact form submissions, admin checks, and blog articles. Uses `useActor` and `useInternetIdentity` to gate queries on authentication state.",
  "frontend/src/index.css": "Global stylesheet importing Playfair Display and Lato fonts, configuring Tailwind CSS with a navy/gold luxury color palette via CSS custom properties for both light and dark modes. Adds utility classes and a fade-in animation.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the DOM root.",
  "frontend/src/pages/AboutPage.tsx": "Static About page for The Jurists law firm displaying a hero section, firm story, team members, and core values with SEO metadata and structured data.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/BlogDetailPage.tsx": "Displays a single blog article fetched by ID from the backend, rendering its title, author, date, category badge, and content with SEO head and structured data markup.",
  "frontend/src/pages/BlogListPage.tsx": "Lists all blog articles fetched from the backend in a responsive card grid with category badges, excerpts, and navigation to individual article pages, including SEO and structured data.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with a hero section, contact info cards (location, email, hours), a contact form, and an embedded map, along with SEO and structured data components.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty file, likely a placeholder for a Google site verification page.",
  "frontend/src/pages/HomePage.tsx": "Renders the main landing page with a hero section, practice areas grid, 'Why Choose Us' highlights, and SEO/structured data, listing 11 legal practice areas for The Jurists Hyderabad.",
  "frontend/src/pages/InitializeAdminPage.tsx": "One-time admin setup page that prompts the user to log in via Internet Identity and initialize admin access control on the backend, then redirects to the leads dashboard on success.",
  "frontend/src/pages/JurisdictionPage.tsx": "Reusable page component that renders location-specific legal service content for four Hyderabad-area jurisdictions (Hyderabad, Secunderabad, Rangareddy, Cyberabad) using a data map, with SEO and structured data.",
  "frontend/src/pages/LeadsPage.tsx": "Admin-only dashboard page that displays and manages contact form submissions with filtering by jurisdiction and status, status update controls, and authentication/authorization guards.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Renders a detailed page for each legal service (family law, corporate law, etc.) using slug-based routing, displaying description, features list, and SEO metadata with structured data.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of all 11 legal services offered by The Jurists with icons, descriptions, gradient styling, and links to individual service detail pages.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file with no content or exports.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom OKLCH-based color tokens, serif/sans font families, luxury box shadows, border radius variables, and accordion/fade-in animations.",
  "project_state.json": "Tracks project state at version 3, listing existing features and pending fix requests to revert the visual theme/images, remove the phone number, and remove the login button."
}