{
  "kind": "build_request",
  "title": "Shorten legal disclaimer to footer and add promotional banner on homepage",
  "projectName": "The Jurists",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the existing LegalNoticeBanner (dismissible top banner with full disclaimer text) with a condensed legal disclaimer line placed at the very bottom of the page, inside or just above the Footer component in Layout.tsx. The shortened text should read: 'The information on this site is for general informational purposes only and does not constitute legal advice. No attorney-client relationship is formed. As per Bar Council of India rules, advocates are not permitted to solicit work or advertise.'",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "shorten and shift this to the bottom of the page"
        ]
      },
      "acceptanceCriteria": [
        "The full-length dismissible top banner (LegalNoticeBanner) is no longer rendered at the top of the page",
        "A compact, non-dismissible legal disclaimer line appears at the bottom of every page, below or within the footer area",
        "The shortened disclaimer text matches the specified condensed version",
        "The disclaimer is styled subtly (small font, muted color) to not overshadow page content"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a prominent promotional banner on the HomePage (frontend/src/pages/HomePage.tsx) that displays the text: 'Send a Legal Notice / Reply to a Legal Notice under 24 hours'. This banner should appear near the top of the homepage content (e.g., just below the hero section or as part of it) and use a visually distinct, attention-grabbing style consistent with the site's existing theme.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "add a banner on the front page itself showing \"Send a Legal Notice/ Reply to a Legal notice under 24 hours\""
        ]
      },
      "acceptanceCriteria": [
        "A banner with the exact text 'Send a Legal Notice / Reply to a Legal Notice under 24 hours' is visible on the homepage",
        "The banner is prominently placed near the top of the homepage (e.g., below the hero or as a highlighted strip)",
        "The banner styling is visually distinct and attention-grabbing while matching the site's color palette and typography",
        "The banner does not appear on other pages (it is homepage-only)"
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/ or frontend/src/components/ui/",
    "Preserve all existing footer content in Footer.tsx; only append the disclaimer, do not replace existing footer elements",
    "The promotional banner text must be verbatim: 'Send a Legal Notice / Reply to a Legal Notice under 24 hours'"
  ],
  "nonGoals": [
    "Adding any new backend logic or data models",
    "Changing the site's overall visual theme or color palette",
    "Adding click/navigation behavior to the promotional banner unless it was requested",
    "Modifying any other pages beyond HomePage.tsx and Layout.tsx"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}