{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix email address and apply 42nd draft theme",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace all occurrences of the current email address in the frontend with 'thejuristshyd@gmail.com'",
      "acceptanceCriteria": [
        "Every visible email address on the site shows 'thejuristshyd@gmail.com'",
        "mailto: links (if any) use 'thejuristshyd@gmail.com'",
        "No old/placeholder email address remains anywhere in the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Replace the current email address with 'thejuristshyd@gmail.com' in all email display locations and mailto: links within the ContactPage component."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Replace the current email address with 'thejuristshyd@gmail.com' in the Footer component where contact information is displayed."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Revert the visual theme (color palette, typography, spacing, component styling, and decorative elements) to match the 42nd draft version",
      "acceptanceCriteria": [
        "The color palette, font choices, and overall visual style match the 42nd draft",
        "The theme is applied consistently across all pages and shared components (Header, Footer, etc.)",
        "No elements from later theme versions remain visible",
        "index.css and tailwind.config.js reflect the 42nd draft design tokens"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Revert the global stylesheet to the 42nd draft version, restoring the original color palette (CSS custom properties for navy/gold luxury theme), typography (Playfair Display and Lato fonts), spacing, and utility classes. Ensure both light and dark mode variables match the 42nd draft configuration."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Revert Tailwind configuration to the 42nd draft version, restoring the original OKLCH-based color tokens, serif/sans font families, luxury box shadows, border radius variables, and animation settings (accordion/fade-in)."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Revert Header component styling to match the 42nd draft theme, ensuring navigation, dropdowns, and mobile menu use the correct color palette, typography, spacing, and decorative elements from the 42nd draft."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Revert Footer component styling to match the 42nd draft theme, ensuring brand info, links, and layout use the correct color palette, typography, and spacing from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Revert HomePage styling to match the 42nd draft theme, ensuring the hero section, practice areas grid, and 'Why Choose Us' section use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Revert ContactPage styling to match the 42nd draft theme, ensuring the hero section, contact info cards, form, and map embed use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/AboutPage.tsx",
          "operation": "modify",
          "description": "Revert AboutPage styling to match the 42nd draft theme, ensuring the hero section, firm story, team members, and core values sections use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/ServicesPage.tsx",
          "operation": "modify",
          "description": "Revert ServicesPage styling to match the 42nd draft theme, ensuring the service cards grid with icons, descriptions, and gradient styling use the correct color palette, typography, spacing, and visual elements from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/ServiceDetailPage.tsx",
          "operation": "modify",
          "description": "Revert ServiceDetailPage styling to match the 42nd draft theme, ensuring the detail view, features list, and layout use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/JurisdictionPage.tsx",
          "operation": "modify",
          "description": "Revert JurisdictionPage styling to match the 42nd draft theme, ensuring the location-specific content, service listings, and layout use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/BlogListPage.tsx",
          "operation": "modify",
          "description": "Revert BlogListPage styling to match the 42nd draft theme, ensuring the article cards grid, category badges, excerpts, and navigation use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/pages/BlogDetailPage.tsx",
          "operation": "modify",
          "description": "Revert BlogDetailPage styling to match the 42nd draft theme, ensuring the article title, author info, date display, category badge, and content rendering use the correct color palette, typography, spacing, and visual styling from the 42nd draft."
        },
        {
          "path": "frontend/src/components/ContactForm.tsx",
          "operation": "modify",
          "description": "Revert ContactForm component styling to match the 42nd draft theme, ensuring the Card container, luxury theme borders, and iframe embed use the correct color palette, spacing, and visual styling from the 42nd draft."
        }
      ]
    }
  ]
}