{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shorten legal disclaimer to footer and add promotional banner on homepage",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the dismissible top LegalNoticeBanner with a condensed legal disclaimer line at the bottom of the page within or above the Footer component",
      "acceptanceCriteria": [
        "The full-length dismissible top banner (LegalNoticeBanner) is no longer rendered at the top of the page",
        "A compact, non-dismissible legal disclaimer line appears at the bottom of every page, below or within the footer area",
        "The shortened disclaimer text matches the specified condensed version",
        "The disclaimer is styled subtly (small font, muted color) to not overshadow page content"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Remove the LegalNoticeBanner import and its rendering from the Layout component. The banner currently appears at the top of the layout and must be completely removed."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add a new condensed legal disclaimer section at the bottom of the Footer component (after existing footer content). The disclaimer text must read exactly: 'The information on this site is for general informational purposes only and does not constitute legal advice. No attorney-client relationship is formed. As per Bar Council of India rules, advocates are not permitted to solicit work or advertise.' Style it with small font size (text-xs), muted text color (text-gray-500 or text-gray-600), center alignment, and appropriate padding. The disclaimer should be non-dismissible and appear as a simple text paragraph or div."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a prominent promotional banner on the HomePage displaying '24-hour legal notice service' messaging",
      "acceptanceCriteria": [
        "A banner with the exact text 'Send a Legal Notice / Reply to a Legal Notice under 24 hours' is visible on the homepage",
        "The banner is prominently placed near the top of the homepage (e.g., below the hero or as a highlighted strip)",
        "The banner styling is visually distinct and attention-grabbing while matching the site's color palette and typography",
        "The banner does not appear on other pages (it is homepage-only)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Add a prominent promotional banner component or section within HomePage.tsx that displays the exact text: 'Send a Legal Notice / Reply to a Legal Notice under 24 hours'. Position this banner near the top of the page content, ideally just below the hero section or as a highlighted strip above the practice areas grid. Style the banner to be visually distinct and attention-grabbing using the site's existing color palette (consider using bg-blue-600 or bg-amber-500 with contrasting text, larger font size, bold weight, and adequate padding). Ensure the banner is homepage-only and does not require any backend integration."
        }
      ]
    }
  ]
}