{
  "backend/main.mo": "Main Motoko actor defining data types (Jurisdiction, LeadStatus, TrendRelevance, PracticeArea, ContactFormSubmission) with comparison functions, managing contact form submissions storage, and implementing access control initialization with admin checks.",
  "feature_evidence.json": "Feature evidence report documenting completion of sitemap.xml and robots.txt files with high confidence, listing affected files and test IDs (REQ-31, REQ-32).",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including routing, SEO, admin dashboard, contact forms, jurisdiction pages, and styling with luxury legal theme using OKLCH colors.",
  "frontend/index.html": "HTML entry point with AMP Analytics and Google Tag Manager integration scripts for tracking and analytics.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console verification file for domain ownership confirmation.",
  "frontend/public/robots.txt": "Robots.txt file allowing all search engine crawlers with sitemap reference to https://thejurists.in/sitemap.xml.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public pages (home, about, services, service details, blog, contact, jurisdictions) with lastmod dates, changefreq, and priority values for SEO.",
  "frontend/src/App.tsx": "Main React app with TanStack Router configuration defining all routes (home, services, blog with $articleId parameter, jurisdictions, admin) wrapped in ThemeProvider with ErrorBoundary and Toaster.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty component file for backlink submission functionality (not yet implemented).",
  "frontend/src/components/Breadcrumbs.tsx": "Breadcrumb navigation component with structured data schema generation for SEO, displaying hierarchical page paths with chevron separators.",
  "frontend/src/components/ContactForm.tsx": "Reusable contact form component embedding Google Forms iframe (default URL provided) with luxury-themed card styling and configurable dimensions (640x978px).",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches rendering errors and displays a fallback UI with error details, reset, and home navigation options.",
  "frontend/src/components/FAQSection.tsx": "Renders an accordion-based FAQ section with structured data schema for SEO, accepting an array of question-answer pairs.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Site footer component displaying branding, contact info, quick links, services, jurisdictions, and copyright information in a responsive grid layout.",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, nav links, jurisdiction dropdown, mobile menu, and authentication/admin controls using Internet Identity.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps pages with Header, main content area (Outlet), and Footer in a flex column structure.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users to enter their name and saves it via the saveCallerUserProfile mutation.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content.",
  "frontend/src/components/SEOHead.tsx": "Component that dynamically updates document title, meta tags (description, keywords, OG, Twitter), and canonical link for SEO purposes.",
  "frontend/src/components/StructuredData.tsx": "Component that injects JSON-LD structured data scripts into the document head, with helper functions for generating local business, organization, service, breadcrumb, article, and FAQ schemas.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profiles, contact form submissions, admin checks, and blog articles with proper caching and invalidation strategies.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom luxury legal theme using deep navy and gold color palette, supporting both light and dark modes with OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/AboutPage.tsx": "About page showcasing The Jurists law firm's story, values (integrity, excellence, client-focus, expertise), achievements, and team information with SEO optimization and structured data.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty admin dashboard page component (no implementation present).",
  "frontend/src/pages/BlogDetailPage.tsx": "Individual blog article page that fetches and displays article content by ID with author info, publication date, category badges, SEO metadata, and structured data for articles.",
  "frontend/src/pages/BlogListPage.tsx": "Blog listing page displaying all published articles in a grid with category badges, excerpts, publication dates, and SEO optimization including breadcrumbs and structured data.",
  "frontend/src/pages/ContactPage.tsx": "Contact page component displaying law firm contact information (email, phone, location, hours) with a contact form, SEO metadata, structured data for local business, and breadcrumbs navigation.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Homepage component showcasing practice areas (family, corporate, criminal, civil, property law), why-choose-us section, and hero content with SEO optimization and structured data for local business and organization.",
  "frontend/src/pages/InitializeAdminPage.tsx": "Admin initialization page that allows the first user to connect their Internet Identity and establish admin access for the leads dashboard, with one-time setup flow and error handling.",
  "frontend/src/pages/JurisdictionPage.tsx": "Dynamic jurisdiction page component displaying location-specific legal services for Hyderabad, Secunderabad, Rangareddy, or Cyberabad with tailored practice areas, contact information, and SEO metadata.",
  "frontend/src/pages/LeadsPage.tsx": "Protected admin dashboard page for viewing and managing contact form submissions with filtering by jurisdiction and status, status updates, authentication checks, and CSV export functionality.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed information for individual legal services (family law, corporate law, etc.) with service lists, benefits, FAQs, contact forms, SEO metadata, and structured data for search engines.",
  "frontend/src/pages/ServicesPage.tsx": "Overview page listing all legal services offered (family law, corporate law, criminal defense, etc.) with icons, descriptions, images, and links to detailed service pages, including SEO and structured data.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file, likely intended for rendering an XML or HTML sitemap for SEO purposes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended spacing, border radius, shadows, animations, and typography plugins for the application's design system.",
  "project_state.json": "Project metadata tracking architectural decisions (Google Forms integration, SEO implementation), existing features (leads page, admin auth, contact forms, jurisdiction pages), and known routing issues with the leads page."
}