{
  "backend/main.mo": "Main Motoko actor defining data types (Jurisdiction, LeadStatus, TrendRelevance, PracticeArea, ContactFormSubmission) with comparison functions, managing contact form submissions storage, and implementing access control with initialization logic.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features related to replacing custom ContactForm components with embedded Google Forms iframes across ContactForm, ContactPage, JurisdictionPage, and ServiceDetailPage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including App.tsx with TanStack Router setup, custom React Query hooks, layout components, SEO components with JSON-LD schemas, admin dashboard, and various page components with Google Forms integration.",
  "frontend/index.html": "HTML entry point with AMP Analytics and Google Tag Manager scripts for analytics tracking, plus noscript fallback for GTM.",
  "frontend/public/google2b25be66b928ef08.html": "Google Search Console verification file for site ownership verification.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (home, services, jurisdictions, admin pages) and wrapping LeadsPage in ErrorBoundary for error handling.",
  "frontend/src/components/BacklinkSubmissionPanel.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ContactForm.tsx": "Reusable contact form component that renders an embedded Google Forms iframe within a styled Card component, accepting optional googleFormsUrl prop with fallback placeholder.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary class component that catches rendering errors and displays a user-friendly error UI with retry and home navigation options, plus detailed error information in a collapsible section.",
  "frontend/src/components/FloatingAdminButton.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Footer.tsx": "Footer component displaying The Jurists branding, quick links (Home, Services, About, Contact), service categories, jurisdictions (Hyderabad, Secunderabad, Rangareddy, Cyberabad), and copyright information with a gradient logo.",
  "frontend/src/components/GoogleSearchConsoleGuide.tsx": "Empty file with no content.",
  "frontend/src/components/Header.tsx": "Header component with sticky navigation, The Jurists logo, main nav links, jurisdiction dropdown menu, authentication button using Internet Identity, and admin/initialize links for authenticated users with proper permissions.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component that renders Header, main content area with Outlet for nested routes, and Footer in a flex column structure.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for new users to enter their name during initial profile setup, using a form with validation and mutation hook to save the profile.",
  "frontend/src/components/PromotionalGuidancePanel.tsx": "Empty file with no content.",
  "frontend/src/components/SearchFilterBar.tsx": "Empty file with no content.",
  "frontend/src/components/SEOContentIdeasPanel.tsx": "Empty file with no content.",
  "frontend/src/components/SEOHead.tsx": "Empty file with no content.",
  "frontend/src/components/TrafficEngagementPanel.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient configuration with delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, contact form submissions (CRUD operations with filtering by jurisdiction/status), and admin permission checks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom luxury legal theme using deep navy blue and rich gold colors, defining CSS variables for light/dark modes and utility classes for typography and gradients.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page with firm story, core values (Integrity, Excellence, Client-Focused, Expertise), achievements list, and a call-to-action to contact the firm.",
  "frontend/src/pages/AdminDashboard.tsx": "Empty file with no content.",
  "frontend/src/pages/ContactPage.tsx": "Renders the Contact page with firm contact information cards (email, location, office hours) and an embedded ContactForm component that accepts a Google Forms URL.",
  "frontend/src/pages/GoogleVerificationPage.tsx": "Empty file with no content.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying hero section, practice areas (Family, Corporate, Criminal, Civil, Property Law) with cards, reasons to choose the firm, and call-to-action buttons for consultation.",
  "frontend/src/pages/InitializeAdminPage.tsx": "Handles one-time admin initialization by connecting Internet Identity to admin role, checking initialization status, and redirecting to leads dashboard upon successful setup.",
  "frontend/src/pages/JurisdictionPage.tsx": "Displays jurisdiction-specific legal services for Hyderabad, Secunderabad, Rangareddy, or Cyberabad with tailored practice areas, descriptions, and contact forms for each location.",
  "frontend/src/pages/LeadsPage.tsx": "Admin-only page that displays contact form submissions in a filterable table with status management (new, contacted, resolved), requiring Internet Identity authentication and admin verification.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed information for a specific legal service (family law, corporate law, criminal defense, etc.) with service descriptions, benefits, and an embedded Google Forms contact form.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all 10 legal service offerings (family law, corporate law, criminal defense, civil litigation, property law, documentation, tax law, IP law, startup law, employment law) with icons, descriptions, and links to detail pages.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file, likely intended for a sitemap page component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended spacing, shadows, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document indicating a law firm application that has switched from custom backend contact forms to Google Forms integration, with features for leads management, admin authentication, and jurisdiction-specific pages."
}